app/views/articles/show.html.erb

<h1><%= @article.title %></h1>
<p>Tags: <% @article.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = ?  [["article_id", 1]]